IDEA Open Model
ResultOfIncrement Class
Compatible with IDEA StatiCa Beta 20.0
Note: This API is now obsolete.
 Result of internal forces in the one position
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.ResultOfIncrement
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
[ObsoleteAttribute]
public class ResultOfIncrement
<ObsoleteAttribute>
Public Class ResultOfIncrement
The ResultOfIncrement type exposes the following members.
Constructors
Name | Description
ResultOfIncrement
Initializes a new instance of the ResultOfIncrement class
Top
Properties
Name | Description
AxialForce
 Axial force
AxialStrain
 Axial strain
AxialStress
 Axial stress
Increment
 Increment of load case
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace